DETERMINAÇÃO
DURABILIDADE E CONTROLE DE GRUPO

APERTO DOS MORTOS-VIVOS
A CADA 4S EM COMBATE, SEU PRÓXIMO ATAQUE BÁSICO CONTRA UM CAMPEÃO IRÁ:
CAUSAR DANO MÁGICO ADICIONAL EQUIVALENTE A 4% DA SUA VIDA MÁXIMA
CURAR VOCÊ EM 2% DA SUA VIDA MÁXIMA
AUMENTAR PERMANENTEMENTE SUA VIDA EM 5
CAMPEÕES DE ATAQUE À DISTÂNCIA: O DANO E A CURA SÃO REDUZIDOS PELA METADE E VOCÊ RECEBE 2 DE VIDA PERMANENTE EM VEZ DISSO.

PÓS-CHOQUE
APÓS IMOBILIZAR UM CAMPEÃO INIMIGO, AUMENTA SUA ARMADURA E RESISTÊNCIA MÁGICA EM 20 + 30% POR 2.5S. DEPOIS EXPLODE, CAUSANDO DANO MÁGICO A INIMIGOS PRÓXIMOS.
DANO: 40 - 140 (+3.5% DE SUA VIDA MÁXIMA).
TEMPO DE RECARGA: 20S

GUARDIÃO
PROTEGE ALIADOS A ATÉ 175 UNIDADES DE VOCÊ E ALIADOS SOBRE OS QUAIS VOCÊ LANÇAR HABILIDADES POR 2.5S. QUANDO VOCÊ ESTIVER PROTEGENDO, SE VOCÊ OU O ALIADO RECEBEREM DANO, AMBOS GANHAM UM ESCUDO E SÃO ACELERADOS POR 1.5S.
TEMPO DE RECARGA: 45S
ESCUDO: 60 - 150 +(0.20 DE PDH) + (+10% DE VIDA ADICIONAL).
ACELERAÇÃO: +20% DE VELOCIDADE DE MOVIMENTO.


DEMOLIR
CARREGA UM PODEROSO ATAQUE CONTRA UMA TORRE POR 4S ENQUANTO ESTIVER A 600 DE DISTÂNCIA. O ATAQUE CARREGADO CAUSA 125 (+30% DE SUA VIDA MÁX.) DE DANO FÍSICO ADICIONAL.
TEMPO DE RECARGA: 45 S

FONTE DA VIDA
DEBILITAR O MOVIMENTO DE UM CAMPEÃO INIMIGO O DEIXA MARCADO POR 4S.
CAMPEÕES ALIADOS QUE ATACAREM INIMIGOS MARCADOS SÃO CURADOS EM 5 + 1.0% DE SUA VIDA MÁXIMA POR 2S.

OSSO REVESTIDO
APÓS SOFRER DANO DE UM CAMPEÃO INIMIGO, OS PRÓXIMOS 3 ATAQUES OU HABILIDADES QUE VOCÊ RECEBER DESSE INIMIGO CAUSARÃO 15 - 40 A MENOS DE DANO.

CONDICIONAMENTO
DEPOIS DE 10 MINS, RECEBE +8 DE ARMADURA E +8 DE RESISTÊNCIA MÁGICA, E AUMENTA SUA ARMADURA E RESISTÊNCIA MÁGICA EM 5%.

VENTOS REVIGORANTES
APÓS RECEBER DANO DE UM CAMPEÃO INIMIGO, RECEBE CURA EQUIVALENTE A 4% DA VIDA PERDIDA +6 POR 10S.

CRISÁLIDA
COMECE O JOGO COM 50 DE VIDA ADICIONAL. APÓS 4 ABATES, CONSUMA ESSA VIDA PARA GANHAR UM ADICIONAL ADAPTATIVO DE 9 DE DANO DE ATAQUE OU 15 DE PODER DE HABILIDADE.

CRESCIMENTO EXCESSIVO
GANHA PERMANENTEMENTE 0.2% DE VIDA MÁXIMA PARA CADA 8 MONSTROS OU TROPAS INIMIGAS QUE MORREREM PERTO DE VOCÊ.

REVITALIZAR
CURAS E ESCUDOS FICAM 5% MAIS FORTES E AUMENTAM EM 10% EM ALVOS COM VIDA INFERIOR A 40%.

INABALÁVEL
DEPOIS DE CONJURAR UM FEITIÇO DE INVOCADOR, RECEBE 15% DE TENACIDADE E DE RESISTÊNCIA À REDUÇÃO DE VELOCIDADE POR 10S. ALÉM DISSO, CONCEDE 10% DE TENACIDADE E RESISTÊNCIA À REDUÇÃO DE VELOCIDADE PARA CADA FEITIÇO DE INVOCADOR EM TEMPO DE RECARGA.