FEITIÇARIA
HABILIDADES FORTALECIDAS E MANIPULAÇÃO DE RECURSOS

INVOCAR AERY
SEUS ATAQUES E HABILIDADES ENVIAM AERY ATÉ UM ALVO, CAUSANDO DANO A INIMIGOS OU PROTEGENDO ALIADOS COM UM ESCUDO.
DANO: DE 20 A 60 COM BASE NO NÍVEL (+0.10 DE PDH E +0.15 DE DDA ADICIONAL)
ESCUDO: DE 30 A 80 COM BASE NO NÍVEL (+0.25 DE PDH E +0.40 DE DDA ADICIONAL)
AERY NÃO PODE SER ENVIADA NOVAMENTE ANTES DE RETORNAR PARA VOCÊ.

COMETA ARCANO
AO CAUSAR DANO A UM CAMPEÃO COM UMA HABILIDADE, UM COMETA É LANÇADO ONDE ELE ESTIVER OU, SE COMETA ARCANO ESTIVER EM TEMPO DE RECARGA, O TEMPO É REDUZIDO.
DANO ADAPTATIVO: DE 30 A 100 COM BASE NO NÍVEL (+0.20 DE PDH E +0.35 DE DDA ADICIONAL)
TEMPO DE RECARGA: 20 - 8S
TEMPO DE RECARGA:
ALVO ÚNICO: 20%.
ÁREA DE AÇÃO: 10%.
DANO AO LONGO DO TEMPO: 5%.

ÍMPETO GRADUAL
ATINGIR UM CAMPEÃO INIMIGO COM 3 ATAQUES OU HABILIDADES SEPARADAS DENTRO DE 3S CONCEDE DE 15 A 40% DE VELOCIDADE DE MOVIMENTO COM BASE NO NÍVEL.
DURAÇÃO: 3S
TEMPO DE RECARGA: 15S
CORPO A CORPO: ALÉM DISSO, RECEBE 75% DE RESISTÊNCIA À REDUÇÃO DE VELOCIDADE ENQUANTO DURAR O EFEITO.

ORBE ANULADOR
AO RECEBER DANO MÁGICO QUE REDUZIRIA SUA VIDA A MENOS DE 30%, VOCÊ GANHA UM ESCUDO QUE ABSORVE 40 - 120 DE DANO MÁGICO COM BASE NO NÍVEL (+0.10 DE PDH E +0.15 DE DDA ADICIONAL) POR 4S.
TEMPO DE RECARGA: 60S

FAIXA DE FLUXO DE MANA
A CADA 60S, A PRÓXIMA HABILIDADE UTILIZADA TEM SEU CUSTO DE MANA OU DE ENERGIA RECUPERADO E RESTAURA 8% DA SUA MANA OU ENERGIA PERDIDA.

MANTO DE NIMBUS
LOGO APÓS A CONJURAÇÃO DA SUA ULTIMATE, CONCEDE UM AUMENTO DE VELOCIDADE DE MOVIMENTO QUE DECAI GRADUALMENTE, DURA 2.5S E PERMITE ATRAVESSAR
UNIDADES.
AUMENTO: 100 DE VELOCIDADE DE MOVIMENTO
TEMPO DE RECARGA: 60S, DIMINUÍDO COM A REDUÇÃO DE TEMPO DE RECARGA.

TRANSCENDÊNCIA
RECEBE 10% DE REDUÇÃO DO TEMPO DE RECARGA QUANDO ATINGE O NÍVEL 10.
CADA PERCENTUAL DE RTR ACIMA DO LIMITE DE RTR É CONVERTIDO EM UM ADICIONAL ADAPTATIVO DE 1.2 DE DANO DE ATAQUE OU 2 DE PODER DE HABILIDADE.

CELERIDADE
RECEBE MAIS 4% DE VELOCIDADE DE MOVIMENTO E ADICIONA 8% DA SUA VELOCIDADE DE MOVIMENTO ADICIONAL AO SEU PDH OU DDA ADAPTATIVOS (COM BASE NO NÍVEL).


FOCO ABSOLUTO
ACIMA DE 70% DE VIDA, RECEBE UM ADICIONAL ADAPTATIVO DE ATÉ 24 DE DANO DE ATAQUE OU 40 DE PODER DE HABILIDADE (COM BASE NO NÍVEL)

CHAMUSCAR
A PRÓXIMA HABILIDADE QUE ATINGIR O ALVO ATEIA FOGO A CAMPEÕES, CAUSANDO DE 30 A 60 DE DANO MÁGICO ADICIONAL COM BASE NO NÍVEL APÓS 1S.
TEMPO DE RECARGA: 20 S

CAMINHAR SOB AS ÁGUAS
RECEBE 25 DE VELOCIDADE DE MOVIMENTO E UM ADICIONAL ADAPTATIVO DE ATÉ 18 DE DANO DE ATAQUE OU 30 DE PODER DE HABILIDADE (COM BASE NO NÍVEL) ENQUANTO ESTIVER NO RIO.

TEMPESTADE CRESCENTE
A CADA 10 MINS, RECEBE PDH OU DDA ADAPTATIVOS.
10 MINS: + 8 DE PDH OU 5 DE DDA
20 MINS: + 24 DE PDH OU 14 DE DDA
30 MINS: + 48 DE PDH OU 29 DE DDA
40 MINS: + 80 DE PDH OU 48 DE DDA
50 MINS: + 120 DE PDH OU 72 DE DDA
60 MINS: + 168 DE PDH OU 101 DE DDA
ETC...

