Inspiração
Ferramentas criativas e distorção das regras

Aprimoramento Glacial
Usar ataques básicos contra um Campeão reduz a velocidade dele por 2s. A força da redução de velocidade aumenta conforme sua duração.
À distância: Ataques à distância causam redução de velocidade de até 20% - 40%
Corpo a corpo: Ataques corpo a corpo causam redução de velocidade de até 40% a 50%
Reduzir a velocidade de um Campeão com itens ativos faz com que um raio de gelo o atravesse, congelando o solo ao seu redor por 5s e reduzindo a velocidade de todas as unidades na área em 50%.
Tempo de Recarga: 7-4s por unidade

Cleptomancia
Após usar uma habilidade, seu próximo ataque contra um Campeão concederá ouro adicional. Você também tem a chance de conseguir um consumível.

Livro de Feitiços Deslacrado
Recebe um Fragmento de Invocador aos 2 mins e outro a cada 6 mins depois disso (máx. de 2 Fragmentos).
Enquanto estiver perto da loja, você pode trocar 1 Fragmento de Invocador para substituir um Feitiço de Invocador por um diferente.
Além disso, os Tempos de Recarga dos seus Feitiços de Invocador são reduzidos em 25%.
Golpear: Comprar Golpear não dará acesso a itens de Golpear.
Você não pode ter dois Feitiços de Invocador iguais

Flashtração Hextec
Enquanto o Flash estiver em Tempo de Recarga, ele é substituído pelo Flash Hextec.
Flash Hextec: Canalize por 2s para se teletransportar para um novo local.
Tempo de Recarga: 20s. Entra em Tempo de Recarga por 10s quando você entra em combate contra um Campeão.

Calçados Mágicos
Recebe Botas Levemente Mágicas gratuitamente aos 10 mins, mas não é possível comprar botas antes disso. Para cada abate, você adquire as botas 30s mais cedo.
Botas Levemente Mágicas concedem um adicional de +10 de Velocidade de Movimento e é aprimorado por menos 50 de ouro.

Sincronia Perfeita
Comece o jogo com um Cronômetro Iniciado que se transforma em Cronômetro após 6 mins. Cronômetro tem um efeito de Estase de uso único.
Reduz o Tempo de Recarga de Ampulheta de Zhonya, Anjo Guardião e Placa Gargolítica em 15%.

Mercado do Futuro
Você pode ficar em débito para comprar itens. A quantidade de empréstimo aumenta com o tempo.
Taxa de empréstimo: 50 de ouro
Limite de débito: 150 + 5/min
(O débito só fica disponível a partir dos 2 minutos)

Pulverizador de Tropas
Comece o jogo com 6 unidades de Pulverizador de Tropas que abatem e absorvem tropas nas rotas instantaneamente. Pulverizador de Tropas fica em Tempo de Recarga pelos primeiros 155s do jogo.
Absorver uma tropa aumenta permanentemente seu dano contra esse tipo de tropa em +4% e em +1% para cada abate adicional desse mesmo tipo de tropa.

Entrega de Biscoitos
Entrega de Biscoitos: Recebe um Biscoito da Eternidade da Determinação Total a cada 3 mins até o minuto 12.
Biscoitos restauram 15% de Vida e Mana perdidas. Consumir Biscoitos aumenta sua Mana máxima em 40 de Mana permanentemente.
Livre de Mana: Campeões sem Mana recuperam 20% da Vida perdida.

Perspicácia Cósmica
+5% RTR
+5% de RTR máx
+5% de RTR dos Feitiços de Invocador
+5% RTR de itens

Velocidade de Aproximação
Recebe 10% de Velocidade de Movimento em direção a Campeões aliados com movimento debilitado ou Campeões inimigos que você debilitou.
Alcance: 1000


Tônico de Distorção no Tempo
Suas poções, biscoitos e elixires duram 20% a mais e você ganha 5% de Velocidade de Movimento quando estiver sob o efeito deles.

