PRECISÃO
ATAQUES APRIMORADOS E SUSTENTAÇÃO DE DANO

PRESSIONE O ATAQUE
ACERTAR UM CAMPEÃO INIMIGO COM 3 ATAQUES BÁSICOS CONSECUTIVOS CAUSA DE 30 A 120 DE DANO ADAPTATIVO ADICIONAL (COM BASE NO NÍVEL) E O DEIXA VULNERÁVEL, AUMENTANDO O DANO RECEBIDO DE TODAS AS FONTES EM 12% POR 6S.

RITMO FATAL
1.5S APÓS CAUSAR DANO A UM CAMPEÃO, VOCÊ GANHA DE 30 A 80% DE VELOCIDADE DE ATAQUE (BASEADO NO NÍVEL) POR 3S. ATACAR UM CAMPEÃO ESTENDE O EFEITO PARA 6S.
TEMPO DE RECARGA: 10 S
RITMO FATAL PERMITE QUE VOCÊ EXCEDA TEMPORARIAMENTE A VELOCIDADE DE ATAQUE LIMITE.

AGILIDADE NOS PÉS
ATACAR E SE MOVIMENTAR GERA ACÚMULOS DE ENERGIA. COM 100 ACÚMULOS, SEU PRÓXIMO ATAQUE É ENERGIZADO.
ATAQUES ENERGIZADOS CURAM VOCÊ EM 5 A 50 (+0.10 DE DDA ADICIONAL, +0.20 DE PDH) E CONCEDEM +30% DE VELOCIDADE DE MOVIMENTO POR 1S.
A CURA É 60% TÃO EFICAZ QUANDO USADA EM UMA TROPA.

CONQUISTADOR
APÓS 4 SEGUNDOS EM COMBATE, SEU PRIMEIRO ATAQUE CONTRA UM CAMPEÃO INIMIGO LHE CONCEDE 10 A 35 DE DDA, COM BASE NO NÍVEL, POR 3 SEGUNDOS E CONVERTE 20% DO SEU DANO A CAMPEÕES EM DANO VERDADEIRO.

CURA EXCESSIVA
A CURA EXCEDENTE SOBRE VOCÊ É CONVERTIDA EM UM ESCUDO DE ATÉ 10% DA SUA VIDA TOTAL + 10.
O ESCUDO É GERADO DE 30% DA SUA CURA EXCEDENTE OU ATÉ 300% DA CURA EXCEDENTE DE ALIADOS.

TRIUNFO
ABATES RESTAURAM 15% DA SUA VIDA PERDIDA E CONCEDEM 25 DE OURO ADICIONAL.

PRESENÇA DE ESPÍRITO
POR 5S APÓS SUBIR DE NÍVEL OU REALIZAR UM ABATE, QUALQUER MANA GASTA É TOTALMENTE RESTAURADA.

LENDA: ESPONTANEIDADE
RECEBE 3% DE VELOCIDADE DE ATAQUE MAIS UM ADICIONAL DE 1.5% PARA CADA ACÚMULO DE LENDA (MÁX. DE 10 ACÚMULOS).
GANHA PROGRESSO EM ACÚMULOS DE LENDA POR CADA ABATE DE CAMPEÃO, MONSTRO ÉPICO, MONSTRO GRANDE E TROPA.

LENDA: TENACIDADE
RECEBE 5% DE TENACIDADE MAIS UM ADICIONAL DE 1.5% POR CADA ACÚMULO DE LENDA (MÁX. DE 10 ACÚMULOS).
GANHA PROGRESSO EM ACÚMULOS DE LENDA POR CADA ABATE DE CAMPEÃO, MONSTRO ÉPICO, MONSTRO GRANDE E TROPA.

LENDA: LINHAGEM
GANHA 0.8% DE ROUBO DE VIDA POR CADA ACÚMULO DE LENDA (MÁX. DE 10 ACÚMULOS).
GANHA PROGRESSO EM ACÚMULOS DE LENDA POR CADA ABATE DE CAMPEÃO, MONSTRO ÉPICO, MONSTRO GRANDE E TROPA.

GOLPE DE MISERICÓRDIA
CAUSA 10% A MAIS DE DANO A CAMPEÕES QUE ESTEJAM COM VIDA ABAIXO DE 40%.
ALÉM DISSO, ABATER CAMPEÕES CONCEDE UM ADICIONAL ADAPTATIVO DE 9 DE DANO DE ATAQUE OU 15 DE PODER DE HABILIDADE POR 10S.

DILACERAR
CAUSA ATÉ 4% A MAIS DE DANO A CAMPEÕES COM 150 A MAIS DE VIDA MÁXIMA DO QUE VOCÊ, AUMENTANDO PARA 10% COM 2000 A MAIS DE VIDA MÁXIMA.

ATÉ A MORTE
CAUSA DE 5% A 12% A MAIS DE DANO A CAMPEÕES ENQUANTO SUA VIDA ESTIVER ABAIXO DE 60%. O DANO MÁXIMO É ATINGIDO COM 30% DE VIDA.